What is Pandas?
Pandas is a Python library used for working with data sets.

It has functions for analyzing, cleaning, exploring, and manipulating data.

In [84]:
import pandas as pd

In [85]:
df=pd.read_csv('../sample.csv')

In [86]:
df.head()

   sno             name   age   salary     designation        mobile
0    1    shabeeh abaas  23.0  $20,000         manager  9.140098e+09
1    2  kashish agrawal  21.0  $23,000        manager   3.242343e+08
2    3     nisha shukla  22.0  $32,000  region manager  2.903482e+09
3    4     kriti rajput  22.0   $3,333             NaN           NaN
4    5     deepak gupta  23.0  $33,000         manager  2.343243e+08

In [87]:
# df.notnull()         #to check not null values
# df.isnull()          #to check null values

# df.isnull().sum()    #to check no of null values
# df.info() for information

DATA CLEANING
---------------At the time of cleaning first thing is--------------------
[imputation]handle missing values(numerical type,text based'string' type)--replace-missing-value
    [we find average of the values and place the value at the missing value place]
    for that we use logic(MEAN) and use library(SCIKIT-LEARN) Use class simpleimputer(finds the null and place the average of all values)

    [if missing value is text type]use logic(FREQUENCY) use any class in various ways]

[clean up]string cleaning[(string to numerical]type.. for a numerical col) we use STRING FUNCTIONS and should know pandas str functions
    we should know pandas str function,lambda expression, apply and applymap()

[row/columns remove] logic is DROP THE COL and library is PD.DROP()
[columns add] logic is (data to fill the columns)
[column renaming] library use ( pd.rename())
[row add] logic is (data fro the column)
[replace values in row/col] logic (data to replace) should know function (pd.replace())

In [88]:
df

   sno             name   age   salary     designation        mobile
0    1    shabeeh abaas  23.0  $20,000         manager  9.140098e+09
1    2  kashish agrawal  21.0  $23,000        manager   3.242343e+08
2    3     nisha shukla  22.0  $32,000  region manager  2.903482e+09
3    4     kriti rajput  22.0   $3,333             NaN           NaN
4    5     deepak gupta  23.0  $33,000         manager  2.343243e+08
5    6     mayank singh  23.0      NaN  region manager  2.334243e+08
6    7     aditya sagar   NaN  $23,333         manager  2.342423e+09
7    8         prashant  22.0   $3,333        director  2.324343e+07

cleaning function

In [89]:
def salary_clean(salary):
    if isinstance(salary,str): # to check type of the data
        salary=salary.strip()
        if '$' in salary:
            salary=salary.replace('$','')
        if ',' in salary:
            salary=salary.replace(',','')

        return int(salary)
    return salary

In [90]:
#for cleaning
# test run
df['salary'].apply(salary_clean)

0    20000.0
1    23000.0
2    32000.0
3     3333.0
4    33000.0
5        NaN
6    23333.0
7     3333.0
Name: salary, dtype: float64

In [91]:
#final apply
df['salary']=df['salary'].apply(salary_clean)
df

   sno             name   age   salary     designation        mobile
0    1    shabeeh abaas  23.0  20000.0         manager  9.140098e+09
1    2  kashish agrawal  21.0  23000.0        manager   3.242343e+08
2    3     nisha shukla  22.0  32000.0  region manager  2.903482e+09
3    4     kriti rajput  22.0   3333.0             NaN           NaN
4    5     deepak gupta  23.0  33000.0         manager  2.343243e+08
5    6     mayank singh  23.0      NaN  region manager  2.334243e+08
6    7     aditya sagar   NaN  23333.0         manager  2.342423e+09
7    8         prashant  22.0   3333.0        director  2.324343e+07

removing column mobile

In [92]:
#test run       df.drop('['mobile','sno','name'],axis=1) #axis define column 
#if any col has same value or unique values then the column is worst
#(but it is not for the predictable col)

In [93]:
#actual run
df.drop(['mobile','sno','name'],axis=1,inplace=True)#inpalce makes the changes into the actual data
df

    age   salary     designation
0  23.0  20000.0         manager
1  21.0  23000.0        manager
2  22.0  32000.0  region manager
3  22.0   3333.0             NaN
4  23.0  33000.0         manager
5  23.0      NaN  region manager
6   NaN  23333.0         manager
7  22.0   3333.0        director

# Scikit-learn

In [94]:
from sklearn.impute import SimpleImputer

In [95]:
SimpleImputer?

Init signature:
SimpleImputer(
    *,
    missing_values=nan,
    strategy='mean',
    fill_value=None,
    verbose=0,
    copy=True,
    add_indicator=False,
)
Docstring:
Imputation transformer for completing missing values.

Read more in the :ref:`User Guide <impute>`.

.. versionadded:: 0.20
   `SimpleImputer` replaces the previous `sklearn.preprocessing.Imputer`
   estimator which is now removed.

Parameters
----------
missing_values : int, float, str, np.nan or None, default=np.nan
    The placeholder for the missing values. All occurrences of
    `missing_values` will be imputed. For pandas' dataframes with
    nullable integer dtypes with missing values, `missing_values`
    should be set to `np.nan`, since `pd.NA` will be converted to `np.nan`.

strategy : str, default='mean'
    The imputation strategy.

    - If "mean", then replace missing values using the mean along
      each column. Can only be used with numeric data.
    - If "median", then replace missing values using the median along
      each column. Can only be used with numeric data.
    - If "most_frequent", then replace missing using the most frequent
      value along each column. Can be used with strings or numeric data.
      If there is more than one such value, only the smallest is returned.
    - If "constant", then replace missing values with fill_value. Can be
      used with strings or numeric data.

    .. versionadded:: 0.20
       strategy="constant" for fixed value imputation.

fill_value : str or numerical value, default=None
    When strategy == "constant", fill_value is used to replace all
    occurrences of missing_values.
    If left to the default, fill_value will be 0 when imputing numerical
    data and "missing_value" for strings or object data types.

verbose : int, default=0
    Controls the verbosity of the imputer.

copy : bool, default=True
    If True, a copy of `X` will be created. If False, imputation will
    be done in-place whenever possible. Note that, in the following cases,
    a new copy will always be made, even if `copy=False`:

    - If `X` is not an array of floating values;
    - If `X` is encoded as a CSR matrix;
    - If `add_indicator=True`.

add_indicator : bool, default=False
    If True, a :class:`MissingIndicator` transform will stack onto output
    of the imputer's transform. This allows a predictive estimator
    to account for missingness despite imputation. If a feature has no
    missing values at fit/train time, the feature won't appear on
    the missing indicator even if there are missing values at
    transform/test time.

Attributes
----------
statistics_ : array of shape (n_features,)
    The imputation fill value for each feature.
    Computing statistics can result in `np.nan` values.
    During :meth:`transform`, features corresponding to `np.nan`
    statistics will be discarded.

indicator_ : :class:`~sklearn.impute.MissingIndicator`
    Indicator used to add binary indicators for missing values.
    `None` if `add_indicator=False`.

n_features_in_ : int
    Number of features seen during :term:`fit`.

    .. versionadded:: 0.24

feature_names_in_ : ndarray of shape (`n_features_in_`,)
    Names of features seen during :term:`fit`. Defined only when `X`
    has feature names that are all strings.

    .. versionadded:: 1.0

See Also
--------
IterativeImputer : Multivariate imputation of missing values.

Notes
-----
Columns which only contained missing values at :meth:`fit` are discarded
upon :meth:`transform` if strategy is not `"constant"`.

Examples
--------
>>> import numpy as np
>>> from sklearn.impute import SimpleImputer
>>> imp_mean = SimpleImputer(missing_values=np.nan, strategy='mean')
>>> imp_mean.fit([[7, 2, 3], [4, np.nan, 6], [10, 5, 9]])
SimpleImputer()
>>> X = [[np.nan, 2, 3], [4, np.nan, 6], [10, np.nan, 9]]
>>> print(imp_mean.transform(X))
[[ 7.   2.   3. ]
 [ 4.   3.5  6. ]
 [10.   3.5  9. ]]
File:           c:\users\administrator\miniconda3\envs\digi\lib\site-packages\sklearn\impute\_base.py
Type:           type
Subclasses:

In [96]:
imputer = SimpleImputer()

In [97]:
cols= ["age","salary"]
imputer.fit_transform(df[cols])

array([[2.30000000e+01, 2.00000000e+04],
       [2.10000000e+01, 2.30000000e+04],
       [2.20000000e+01, 3.20000000e+04],
       [2.20000000e+01, 3.33300000e+03],
       [2.30000000e+01, 3.30000000e+04],
       [2.30000000e+01, 1.97141429e+04],
       [2.22857143e+01, 2.33330000e+04],
       [2.20000000e+01, 3.33300000e+03]])

In [98]:
cols= ["age","salary"]
df[cols]= imputer.fit_transform(df[cols])

In [99]:
df

         age        salary     designation
0  23.000000  20000.000000         manager
1  21.000000  23000.000000        manager
2  22.000000  32000.000000  region manager
3  22.000000   3333.000000             NaN
4  23.000000  33000.000000         manager
5  23.000000  19714.142857  region manager
6  22.285714  23333.000000         manager
7  22.000000   3333.000000        director

In [100]:
imp2 =SimpleImputer(strategy='most_frequent')
imp2.fit_transform(df[["designation"]])

array([['manager'],
       ['manager '],
       ['region manager'],
       ['manager'],
       ['manager'],
       ['region manager'],
       ['manager'],
       ['director']], dtype=object)

In [101]:
SimpleImputer()

SimpleImputer()

In [102]:
imp2 =SimpleImputer(strategy='most_frequent')
df['designation']=imp2.fit_transform(df[["designation"]])

In [103]:
df

         age        salary     designation
0  23.000000  20000.000000         manager
1  21.000000  23000.000000        manager
2  22.000000  32000.000000  region manager
3  22.000000   3333.000000         manager
4  23.000000  33000.000000         manager
5  23.000000  19714.142857  region manager
6  22.285714  23333.000000         manager
7  22.000000   3333.000000        director

In [104]:
gender = ["male","female"]*4

In [105]:
df["Gender"]=gender

In [106]:
df

         age        salary     designation  Gender
0  23.000000  20000.000000         manager    male
1  21.000000  23000.000000        manager   female
2  22.000000  32000.000000  region manager    male
3  22.000000   3333.000000         manager  female
4  23.000000  33000.000000         manager    male
5  23.000000  19714.142857  region manager  female
6  22.285714  23333.000000         manager    male
7  22.000000   3333.000000        director  female

In [107]:
df.rename({"salary" : "pay"},axis=1,inplace=True)

In [108]:
df

         age           pay     designation  Gender
0  23.000000  20000.000000         manager    male
1  21.000000  23000.000000        manager   female
2  22.000000  32000.000000  region manager    male
3  22.000000   3333.000000         manager  female
4  23.000000  33000.000000         manager    male
5  23.000000  19714.142857  region manager  female
6  22.285714  23333.000000         manager    male
7  22.000000   3333.000000        director  female

In [109]:
df.loc[0]

age               23.0
pay            20000.0
designation    manager
Gender            male
Name: 0, dtype: object

In [110]:
row=[{
    "age":"19",
    "pay":"2000",
    "designation":"Assistant manager",
    "Gender":"male"
},
{
    "age":"120",
    "pay":"3000",
    "designation":"manager",
    "Gender":"female"
}]

In [111]:
df =df.append(row,ignore_index=True)

<ipython-input-111-6ba6588aaf38>:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df =df.append(row,ignore_index=True)

In [112]:
df

         age           pay        designation  Gender
0       23.0       20000.0            manager    male
1       21.0       23000.0           manager   female
2       22.0       32000.0     region manager    male
3       22.0        3333.0            manager  female
4       23.0       33000.0            manager    male
5       23.0  19714.142857     region manager  female
6  22.285714       23333.0            manager    male
7       22.0        3333.0           director  female
8         19          2000  Assistant manager    male
9        120          3000            manager  female

In [113]:
df["Gender"].value_counts()

male      5
female    5
Name: Gender, dtype: int64

In [114]:
from sklearn.preprocessing import LabelEncoder

In [115]:
gender_enc =LabelEncoder()
gender_enc.fit(df["Gender"])

LabelEncoder()

In [116]:
gender_enc.transform(df["Gender"])

array([1, 0, 1, 0, 1, 0, 1, 0, 1, 0])

In [117]:
df["gender"]=gender_enc.transform(df["Gender"])

In [119]:
df

         age           pay        designation  Gender  gender
0       23.0       20000.0            manager    male       1
1       21.0       23000.0           manager   female       0
2       22.0       32000.0     region manager    male       1
3       22.0        3333.0            manager  female       0
4       23.0       33000.0            manager    male       1
5       23.0  19714.142857     region manager  female       0
6  22.285714       23333.0            manager    male       1
7       22.0        3333.0           director  female       0
8         19          2000  Assistant manager    male       1
9        120          3000            manager  female       0

In [120]:
gender_enc.classes_

array(['female', 'male'], dtype=object)

In [125]:
gender_enc.inverse_transform([0,1]) #decode

array(['female', 'male'], dtype=object)